---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctInsulation
source: html/c13867c8-eb32-7545-8e07-a7db00fcaeb6.htm
---
# DuctInsulation Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.